clamp_supp/clamp_9010/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

points  (
  (4.5 2.85 0.05)
  (4.5 2.5 0.05)
  (4.5 1 0.05)
  (4.5 2.95 0.05)
  (2.2 1.5 0.05)
  (6.8 1.5 0.05)
  (0.3 0.2 0.05)
  (8.7 0.2 0.05)
  (4.5 3.05 0.05)
  (4.5 3.1 0.05)
  (4.5 7.5 0.05)
  (1.95 1.5 0.05)
  (1.9 1.5 0.05)
  (0 1.5 0.05)
  (7.05 1.5 0.05)
  (7.1 1.5 0.05)
  (9 1.5 0.05)
);

fields  (U);

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

// ************************************************************************* //
